In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
os.getcwd()

'C:\\Users\\user\\Desktop\\Upgrad\\Praxis'

In [2]:
train=pd.read_csv('C:\\Users\\user\\Desktop\\Upgrad\\Praxis\\train.csv')
test=pd.read_csv('C:\\Users\\user\\Desktop\\Upgrad\\Praxis\\test_F9a0NJV.csv')
customer=pd.read_csv('C:\\Users\\user\\Desktop\\Upgrad\\Praxis\\customer.csv')

In [3]:
submission=pd.read_csv('C:\\Users\\user\\Desktop\\Upgrad\\Praxis\\sample_submission_85njlT4.csv')

In [4]:
submission.head()

     cust_id  purchase
0  cust_2341         0
1  cust_3165         0
2  cust_8760         0
3  cust_6397         0
4  cust_6465         0

In [5]:
submission.cust_id=test.cust_id

In [6]:
train.head()

,cust_id,product_id,visit_date,campaign_category,prod_char_1,prod_char_2,prod_char_3,prod_char_4,prod_char_5,prod_char_6,prod_char_7,purchase
0,cust_1312,prod_cat2_831559,22/09/2017,type 5,NaN,NaN,NaN,NaN,NaN,NaN,cat 208,1
1,cust_1427,prod_cat2_4262088,05/08/2018,type 3,NaN,NaN,NaN,NaN,NaN,NaN,cat 61,0
2,cust_8575,prod_cat2_2480790,15/10/2017,type 5,NaN,NaN,NaN,NaN,NaN,NaN,cat 433,1
3,cust_6737,prod_cat2_2142924,23/10/2017,type 5,NaN,NaN,NaN,NaN,NaN,NaN,cat 2114,0
4,cust_8169,prod_cat2_3877499,05/03/2018,type 3,NaN,NaN,NaN,NaN,NaN,NaN,cat 2,0

In [7]:
train.shape

(77000, 12)

In [8]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77000 entries, 0 to 76999
Data columns (total 12 columns):
cust_id              77000 non-null object
product_id           77000 non-null object
visit_date           77000 non-null object
campaign_category    77000 non-null object
prod_char_1          6127 non-null object
prod_char_2          6127 non-null object
prod_char_3          6127 non-null object
prod_char_4          6127 non-null object
prod_char_5          6127 non-null object
prod_char_6          6127 non-null object
prod_char_7          70873 non-null object
purchase             77000 non-null int64
dtypes: int64(1), object(11)
memory usage: 7.0+ MB

In [9]:
train.cust_id.nunique()

7189

In [10]:
customer.head()

,cust_id,city,cust_group,cust_type,cust_approach_date,cust_attrb_1,cust_attrb_2,cust_attrb_3,cust_attrb_4,cust_attrb_5,...,cust_attrb_19,cust_attrb_20,cust_attrb_21,cust_attrb_22,cust_attrb_23,cust_attrb_24,cust_attrb_25,cust_attrb_26,cust_attrb_27,cust_attrb_28
0,cust_0,city 2,group 17304,type 2,21/04/2018,cat 4,cat 6,cat 4,cat 5,cat 22,...,0,0,0,0,0,0,0,0,0,0
1,cust_1,city 2,group 21731,type 3,25/02/2016,cat 21,cat 4,cat 3,cat 1,cat 1,...,0,0,0,0,0,0,0,0,0,75
2,cust_2,city 2,group 48077,type 3,31/05/2018,cat 6,cat 8,cat 5,cat 5,cat 15,...,0,1,0,0,1,0,0,1,1,87
3,cust_3,city 1,group 15391,type 1,29/09/2017,cat 4,cat 7,cat 4,cat 1,cat 2,...,1,1,1,1,0,0,0,1,1,89
4,cust_4,city 2,group 17304,type 2,16/02/2018,cat 5,cat 5,cat 5,cat 7,cat 14,...,0,0,0,0,0,0,0,0,0,0

In [11]:
train_data=train.merge(customer,how='left',on='cust_id')

In [12]:
train_data.shape

(77000, 44)

In [13]:
train_data.head()

,cust_id,product_id,visit_date,campaign_category,prod_char_1,prod_char_2,prod_char_3,prod_char_4,prod_char_5,prod_char_6,...,cust_attrb_19,cust_attrb_20,cust_attrb_21,cust_attrb_22,cust_attrb_23,cust_attrb_24,cust_attrb_25,cust_attrb_26,cust_attrb_27,cust_attrb_28
0,cust_1312,prod_cat2_831559,22/09/2017,type 5,NaN,NaN,NaN,NaN,NaN,NaN,...,0,0,1,0,1,0,0,0,0,56
1,cust_1427,prod_cat2_4262088,05/08/2018,type 3,NaN,NaN,NaN,NaN,NaN,NaN,...,0,0,0,0,1,0,0,0,0,86
2,cust_8575,prod_cat2_2480790,15/10/2017,type 5,NaN,NaN,NaN,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,73
3,cust_6737,prod_cat2_2142924,23/10/2017,type 5,NaN,NaN,NaN,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,18
4,cust_8169,prod_cat2_3877499,05/03/2018,type 3,NaN,NaN,NaN,NaN,NaN,NaN,...,0,0,0,0,0,0,0,0,0,0

In [14]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 77000 entries, 0 to 76999
Data columns (total 44 columns):
cust_id               77000 non-null object
product_id            77000 non-null object
visit_date            77000 non-null object
campaign_category     77000 non-null object
prod_char_1           6127 non-null object
prod_char_2           6127 non-null object
prod_char_3           6127 non-null object
prod_char_4           6127 non-null object
prod_char_5           6127 non-null object
prod_char_6           6127 non-null object
prod_char_7           70873 non-null object
purchase              77000 non-null int64
city                  77000 non-null object
cust_group            77000 non-null object
cust_type             77000 non-null object
cust_approach_date    77000 non-null object
cust_attrb_1          77000 non-null object
cust_attrb_2          77000 non-null object
cust_attrb_3          77000 non-null object
cust_attrb_4          77000 non-null object
cust_attrb_5          77000 non-null object
cust_attrb_6          77000 non-null object
cust_attrb_7          77000 non-null object
cust_attrb_8          77000 non-null int64
cust_attrb_9          77000 non-null int64
cust_attrb_10         77000 non-null int64
cust_attrb_11         77000 non-null int64
cust_attrb_12         77000 non-null int64
cust_attrb_13         77000 non-null int64
cust_attrb_14         77000 non-null int64
cust_attrb_15         77000 non-null int64
cust_attrb_16         77000 non-null int64
cust_attrb_17         77000 non-null int64
cust_attrb_18         77000 non-null int64
cust_attrb_19         77000 non-null int64
cust_attrb_20         77000 non-null int64
cust_attrb_21         77000 non-null int64
cust_attrb_22         77000 non-null int64
cust_attrb_23         77000 non-null int64
cust_attrb_24         77000 non-null int64
cust_attrb_25         77000 non-null int64
cust_attrb_26         77000 non-null int64
cust_attrb_27         77000 non-null int64
cust_attrb_28         77000 non-null int64
dtypes: int64(22), object(22)
memory usage: 26.4+ MB

In [15]:
train_data.cust_id.nunique()

7189

In [16]:
train_data.product_id.nunique()
#drop product_id

77000

In [17]:
train_data.campaign_category.nunique()

7

In [18]:
pd.crosstab(train_data.campaign_category,train_data.purchase)

purchase               0      1
campaign_category
type 1              3465   2662
type 2             17627  17166
type 3              4812   4537
type 4              3846   3657
type 5              9731   9217
type 6                63     99
type 7                74     44

There is no such difference b/w count of 0 & 1 for each category

In [19]:
train_data.prod_char_7.nunique()

1937

In [20]:
train_data.city.nunique()

2

In [21]:
pd.crosstab(train_data.city,train_data.purchase)

purchase      0      1
city
city 1     2309   5591
city 2    37309  31791

Customer belonging to city 1 has higher chance to be a valued customer based on above crosstab

In [22]:
train_data.cust_group.nunique()

3160

In [23]:
train_data.cust_type.nunique()

3

In [24]:
pd.crosstab(train_data.cust_type,train_data.purchase)

purchase       0      1
cust_type
type 1      2309   5591
type 2     24829      0
type 3     12480  31791

Type 2 customer are never valued customers

In [25]:
test.shape

(22431, 11)

In [26]:
train_data['cust_attrb_1'].nunique()

38

In [27]:
train_data['cust_attrb_2'].nunique()

25

In [28]:
train_data['cust_attrb_3'].nunique()

9

In [29]:
train_data['cust_attrb_4'].nunique()

7

In [30]:
train_data['cust_attrb_5'].nunique()

25

In [31]:
train_data['cust_attrb_6'].nunique()

8

In [32]:
train_data['cust_attrb_6'].nunique()

8

In [33]:
test_data=test.merge(customer,how='left',on='cust_id')

In [34]:
test_data.shape

(22431, 43)

In [35]:
total=pd.concat([train_data,test_data],axis=0,ignore_index=True,sort=False)

In [36]:
total.shape

(99431, 44)

In [37]:
total['cust_approach_date']=pd.to_datetime(total['cust_approach_date'])

In [38]:
total['visit_date']=pd.to_datetime(total['visit_date'])

In [39]:
total[['cust_approach_date','visit_date']].head()

  cust_approach_date visit_date
0         2015-07-23 2017-09-22
1         2015-08-09 2018-05-08
2         2017-10-14 2017-10-15
3         2017-10-22 2017-10-23
4         2017-11-11 2018-05-03

In [40]:
total['Date_Diff']=(total['visit_date']-total['cust_approach_date']).dt.days

In [41]:
#Drop visit_date and cust_approach_date

In [42]:
total['cust_attrb_1']=total['cust_attrb_1'].str.replace('cat','').astype(int)
total['cust_attrb_2']=total['cust_attrb_2'].str.replace('cat','').astype(int)
total['cust_attrb_3']=total['cust_attrb_3'].str.replace('cat','').astype(int)
total['cust_attrb_4']=total['cust_attrb_4'].str.replace('cat','').astype(int)
total['cust_attrb_5']=total['cust_attrb_5'].str.replace('cat','').astype(int)
total['cust_attrb_6']=total['cust_attrb_6'].str.replace('cat','').astype(int)
total['cust_attrb_7']=total['cust_attrb_7'].str.replace('cat','').astype(int)

In [43]:
total['prod_char_1']=total['prod_char_1'].str.replace('cat','').astype(float)
total['prod_char_2']=total['prod_char_2'].str.replace('cat','').astype(float)
total['prod_char_3']=total['prod_char_3'].str.replace('cat','').astype(float)
total['prod_char_4']=total['prod_char_4'].str.replace('cat','').astype(float)
total['prod_char_5']=total['prod_char_5'].str.replace('cat','').astype(float)
total['prod_char_6']=total['prod_char_6'].str.replace('cat','').astype(float)
total['prod_char_7']=total['prod_char_7'].str.replace('cat','').astype(float)

In [44]:
total.drop(['product_id','visit_date','cust_approach_date'],axis=1,inplace=True)

In [45]:
total.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99431 entries, 0 to 99430
Data columns (total 42 columns):
cust_id              99431 non-null object
campaign_category    99431 non-null object
prod_char_1          7954 non-null float64
prod_char_2          7954 non-null float64
prod_char_3          7954 non-null float64
prod_char_4          7954 non-null float64
prod_char_5          7954 non-null float64
prod_char_6          7954 non-null float64
prod_char_7          91477 non-null float64
purchase             77000 non-null float64
city                 99431 non-null object
cust_group           99431 non-null object
cust_type            99431 non-null object
cust_attrb_1         99431 non-null int32
cust_attrb_2         99431 non-null int32
cust_attrb_3         99431 non-null int32
cust_attrb_4         99431 non-null int32
cust_attrb_5         99431 non-null int32
cust_attrb_6         99431 non-null int32
cust_attrb_7         99431 non-null int32
cust_attrb_8         99431 non-null int64
cust_attrb_9         99431 non-null int64
cust_attrb_10        99431 non-null int64
cust_attrb_11        99431 non-null int64
cust_attrb_12        99431 non-null int64
cust_attrb_13        99431 non-null int64
cust_attrb_14        99431 non-null int64
cust_attrb_15        99431 non-null int64
cust_attrb_16        99431 non-null int64
cust_attrb_17        99431 non-null int64
cust_attrb_18        99431 non-null int64
cust_attrb_19        99431 non-null int64
cust_attrb_20        99431 non-null int64
cust_attrb_21        99431 non-null int64
cust_attrb_22        99431 non-null int64
cust_attrb_23        99431 non-null int64
cust_attrb_24        99431 non-null int64
cust_attrb_25        99431 non-null int64
cust_attrb_26        99431 non-null int64
cust_attrb_27        99431 non-null int64
cust_attrb_28        99431 non-null int64
Date_Diff            99431 non-null int64
dtypes: float64(8), int32(7), int64(22), object(5)
memory usage: 29.2+ MB

In [46]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
total['cust_id']=le.fit_transform(total['cust_id'])

In [47]:
cat_col=list(total.select_dtypes(object))

In [48]:
cat_col

['campaign_category', 'city', 'cust_group', 'cust_type']

In [49]:
dummy=pd.get_dummies(total[cat_col],drop_first=True)

In [50]:
total_data=pd.concat([total,dummy],axis=1)

In [51]:
total_data.head()

,cust_id,campaign_category,prod_char_1,prod_char_2,prod_char_3,prod_char_4,prod_char_5,prod_char_6,prod_char_7,purchase,...,cust_group_group 9948,cust_group_group 9949,cust_group_group 9950,cust_group_group 9954,cust_group_group 996,cust_group_group 9967,cust_group_group 997,cust_group_group 9996,cust_type_type 2,cust_type_type 3
0,289,type 5,NaN,NaN,NaN,NaN,NaN,NaN,208.0,1.0,...,0,0,0,0,0,0,0,0,0,1
1,383,type 3,NaN,NaN,NaN,NaN,NaN,NaN,61.0,0.0,...,0,0,0,0,0,0,0,0,0,1
2,6730,type 5,NaN,NaN,NaN,NaN,NaN,NaN,433.0,1.0,...,0,0,0,0,0,0,0,0,0,1
3,5099,type 5,NaN,NaN,NaN,NaN,NaN,NaN,2114.0,0.0,...,0,0,0,0,0,0,0,0,1,0
4,6382,type 3,NaN,NaN,NaN,NaN,NaN,NaN,2.0,0.0,...,0,0,0,0,0,0,0,0,1,0

In [52]:
total_data.shape

(99431, 3341)

In [53]:
total_data.drop(cat_col,axis=1,inplace=True)

In [54]:
total_data.shape

(99431, 3337)

In [55]:
train_final=total_data[:77000]
test_final=total_data[77000:]

In [56]:
train_final.head()

,cust_id,prod_char_1,prod_char_2,prod_char_3,prod_char_4,prod_char_5,prod_char_6,prod_char_7,purchase,cust_attrb_1,...,cust_group_group 9948,cust_group_group 9949,cust_group_group 9950,cust_group_group 9954,cust_group_group 996,cust_group_group 9967,cust_group_group 997,cust_group_group 9996,cust_type_type 2,cust_type_type 3
0,289,NaN,NaN,NaN,NaN,NaN,NaN,208.0,1.0,4,...,0,0,0,0,0,0,0,0,0,1
1,383,NaN,NaN,NaN,NaN,NaN,NaN,61.0,0.0,7,...,0,0,0,0,0,0,0,0,0,1
2,6730,NaN,NaN,NaN,NaN,NaN,NaN,433.0,1.0,11,...,0,0,0,0,0,0,0,0,0,1
3,5099,NaN,NaN,NaN,NaN,NaN,NaN,2114.0,0.0,14,...,0,0,0,0,0,0,0,0,1,0
4,6382,NaN,NaN,NaN,NaN,NaN,NaN,2.0,0.0,17,...,0,0,0,0,0,0,0,0,1,0

In [57]:
test_final=test_final.reset_index(drop=True)

In [58]:
test_final.head()

,cust_id,prod_char_1,prod_char_2,prod_char_3,prod_char_4,prod_char_5,prod_char_6,prod_char_7,purchase,cust_attrb_1,...,cust_group_group 9948,cust_group_group 9949,cust_group_group 9950,cust_group_group 9954,cust_group_group 996,cust_group_group 9967,cust_group_group 997,cust_group_group 9996,cust_type_type 2,cust_type_type 3
0,1,NaN,NaN,NaN,NaN,NaN,NaN,464.0,NaN,21,...,0,0,0,0,0,0,0,0,0,1
1,1,NaN,NaN,NaN,NaN,NaN,NaN,8.0,NaN,21,...,0,0,0,0,0,0,0,0,0,1
2,2,NaN,NaN,NaN,NaN,NaN,NaN,8.0,NaN,11,...,0,0,0,0,0,0,0,0,0,1
3,3,NaN,NaN,NaN,NaN,NaN,NaN,2.0,NaN,20,...,0,0,0,0,0,0,0,0,0,1
4,7,2.0,16.0,4.0,3.0,2.0,2.0,NaN,NaN,11,...,0,0,0,0,0,0,0,0,1,0

In [59]:
test_final.drop('purchase',axis=1,inplace=True)

In [60]:
X_train=train_final.drop(['purchase'],axis=1)
y_train=train_final.purchase

In [67]:
import lightgbm as lgb

lgb_params = {'boosting_type': 'gbdt',
 'objective': 'binary',
 'metric': 'auc',
 'verbose': 0,
 'bagging_fraction': 0.8,
 'bagging_freq': 1,
 'num_class': 1,
 'feature_fraction': 0.8,
 'lambda_l1': 0.01,
 'lambda_l2': 0.01,
 'learning_rate': 0.01,
 'max_bin': 255,
 'max_depth': -1,
 'min_data_in_bin': 1,
 'min_data_in_leaf': 1,
 'num_leaves': 31,
  }
lgb_params

{'boosting_type': 'gbdt',
 'objective': 'binary',
 'metric': 'auc',
 'verbose': 0,
 'bagging_fraction': 0.8,
 'bagging_freq': 1,
 'num_class': 1,
 'feature_fraction': 0.8,
 'lambda_l1': 0.01,
 'lambda_l2': 0.01,
 'learning_rate': 0.01,
 'max_bin': 255,
 'max_depth': -1,
 'min_data_in_bin': 1,
 'min_data_in_leaf': 1,
 'num_leaves': 31}

In [68]:
clf_lgb_1 = lgb.LGBMClassifier(n_estimators=1000, **lgb_params)
clf_lgb_1.fit(X_train, y_train)

LGBMClassifier(bagging_fraction=0.8, bagging_freq=1, boosting_type='gbdt',
               class_weight=None, colsample_bytree=1.0, feature_fraction=0.8,
               importance_type='split', lambda_l1=0.01, lambda_l2=0.01,
               learning_rate=0.01, max_bin=255, max_depth=-1, metric='auc',
               min_child_samples=20, min_child_weight=0.001, min_data_in_bin=1,
               min_data_in_leaf=1, min_split_gain=0.0, n_estimators=1000,
               n_jobs=-1, num_class=1, num_leaves=31, objective='binary',
               random_state=None, reg_alpha=0.0, reg_lambda=0.0, silent=True,
               subsample=1.0, subsample_for_bin=200000, subsample_freq=0, ...)

In [69]:
y_pred_lgb=clf_lgb_1.predict_proba(test_final)[:,1]

In [70]:
y_pred_lgb

array([5.95612164e-01, 5.94536312e-01, 6.29649423e-01, ...,
       8.14444848e-01, 9.23173929e-01, 6.23254205e-04])

In [71]:
from sklearn.model_selection import cross_val_score
all_scores = cross_val_score(estimator=clf_lgb_1, X=X_train, y=y_train, cv=5,scoring='roc_auc')

In [72]:
all_scores

array([0.98953724, 0.98958988, 0.98784855, 0.98964496, 0.98806968])

In [78]:


lgb_params = {'boosting_type': 'gbdt',
 'objective': 'binary',
 'metric': 'auc',
 'verbose': 0,
 'bagging_fraction': 0.8,
 'bagging_freq': 1,
 'num_class': 1,
 'feature_fraction': 0.8,
 'lambda_l1': 0.01,
 'lambda_l2': 0.01,
 'learning_rate': 0.06,
 'max_bin': 255,
 'max_depth': -1,
 'min_data_in_bin': 1,
 'min_data_in_leaf': 1,
 'num_leaves': 31,
  }
lgb_params

{'boosting_type': 'gbdt',
 'objective': 'binary',
 'metric': 'auc',
 'verbose': 0,
 'bagging_fraction': 0.8,
 'bagging_freq': 1,
 'num_class': 1,
 'feature_fraction': 0.8,
 'lambda_l1': 0.01,
 'lambda_l2': 0.01,
 'learning_rate': 0.06,
 'max_bin': 255,
 'max_depth': -1,
 'min_data_in_bin': 1,
 'min_data_in_leaf': 1,
 'num_leaves': 31}

In [79]:
clf_lgb_2 = lgb.LGBMClassifier(n_estimators=1000, **lgb_params)
clf_lgb_2.fit(X_train, y_train)

LGBMClassifier(bagging_fraction=0.8, bagging_freq=1, boosting_type='gbdt',
               class_weight=None, colsample_bytree=1.0, feature_fraction=0.8,
               importance_type='split', lambda_l1=0.01, lambda_l2=0.01,
               learning_rate=0.06, max_bin=255, max_depth=-1, metric='auc',
               min_child_samples=20, min_child_weight=0.001, min_data_in_bin=1,
               min_data_in_leaf=1, min_split_gain=0.0, n_estimators=1000,
               n_jobs=-1, num_class=1, num_leaves=31, objective='binary',
               random_state=None, reg_alpha=0.0, reg_lambda=0.0, silent=True,
               subsample=1.0, subsample_for_bin=200000, subsample_freq=0, ...)

In [80]:
y_pred_lgb1=clf_lgb_2.predict_proba(test_final)[:,1]

In [81]:
y_pred_lgb1

array([1.53242337e-01, 1.31703539e-01, 1.62887177e-01, ...,
       9.73453923e-01, 9.88607038e-01, 2.74251130e-05])

In [87]:
from sklearn.model_selection import cross_val_score
all_scores = cross_val_score(estimator=clf_lgb_2, X=X_train, y=y_train, cv=5,scoring='roc_auc')

In [88]:
all_scores

array([0.99759726, 0.99758634, 0.99769479, 0.99799693, 0.99723561])

In [89]:
submission=pd.read_csv('C:\\Users\\user\\Desktop\\Upgrad\\Praxis\\sample_submission_85njlT4.csv')

In [90]:
submission.purchase=(y_pred_lgb+y_pred_lgb1)/2

In [91]:
submission.cust_id=test.cust_id

In [92]:
submission.head()

     cust_id  purchase
0     cust_1  0.374427
1     cust_1  0.363120
2   cust_100  0.396268
3  cust_1002  0.848366
4  cust_1006  0.000222

In [93]:
submission=submission.to_csv(r'C:\\Users\\user\\Desktop\\Upgrad\\Praxis\\submission_final.csv',index=False)